test/request-response-samples/get__complex_extension_without_explicit_namespace/request.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:tns="urn:platform_2013_2.webservices.netsuite.com" xmlns:platformMsgs="urn:messages_2013_2.platform.webservices.netsuite.com" xmlns:platformFaults="urn:faults_2013_2.platform.webservices.netsuite.com"><soap:Body><platformMsgs:get xmlns:platformMsgs="urn:messages_2013_2.platform.webservices.netsuite.com" xmlns="urn:messages_2013_2.platform.webservices.netsuite.com"><platformMsgs:baseRef type="contact" internalId="42" xsi:type="ns1:RecordRef" xmlns:ns1="urn:core_2013_2.platform.webservices.netsuite.com"></platformMsgs:baseRef></platformMsgs:get></soap:Body></soap:Envelope>